src/cf/DataProcessors/ПростойПримерРаботыСКомпонентойPinkRabbitMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПростойПримерРаботыСКомпонентойPinkRabbitMQ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Catalogs/Подключение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Подключение</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>21</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВиртуальныйХост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/ПростойПримерРаботыСКомпонентойPinkRabbitMQ/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем Клиент, АдресВоВременномХранилище;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)        
	
	СтрПодключение = Справочники.Подключение.SERVER;
	
	Адрес             = СтрПодключение.Адрес;
	Порт              = СтрПодключение.Порт;
	Логин             = СтрПодключение.Логин;
	Пароль            = СтрПодключение.Пароль;
	ВиртуальныйХост   = СтрПодключение.ВиртуальныйХост;
	ТочкаОбмена       = СтрПодключение.ТочкаОбмена;
	ИмяОчереди        = СтрПодключение.ИмяОчереди; 
	КлючМаршрутизации = СтрПодключение.КлючМаршрутизации;   
	
	ТекстСообщения = ExchangeServer.СформироватьНаСервереТекст();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы     

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("Адрес", Адрес);
	Структура.Вставить("Порт", Порт);
	Структура.Вставить("Логин", Логин);
	Структура.Вставить("Пароль", Пароль);
	Структура.Вставить("ВиртуальныйХост", ВиртуальныйХост);
	Структура.Вставить("ТочкаОбмена", ТочкаОбмена);
	Структура.Вставить("ИмяОчереди", ИмяОчереди);
	
	КлиентКомпоненты = rabbitClientServer.ПолучитьКомпонентуСервер();
	rabbitClientServer.ПроверитьПодключениеКлиентСервер(КлиентКомпоненты,Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеТочкиИОчереди(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("Адрес", Адрес);
	Структура.Вставить("Порт", Порт);
	Структура.Вставить("Логин", Логин);
	Структура.Вставить("Пароль", Пароль);
	Структура.Вставить("ВиртуальныйХост", ВиртуальныйХост);
	Структура.Вставить("ТочкаОбмена", ТочкаОбмена);
	Структура.Вставить("ИмяОчереди", ИмяОчереди);
	
	rabbitClientServer.СозданиеТочкиИОчередиСервер(Структура);
	                      
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)

	ОтправитьСообщениеОбщее();
	
КонецПроцедуры     

&НаКлиенте
Процедура ПрочитатьСообщение(Команда)
	
	
	Структура = Новый Структура;
	Структура.Вставить("Адрес", Адрес);
	Структура.Вставить("Порт", Порт);
	Структура.Вставить("Логин", Логин);
	Структура.Вставить("Пароль", Пароль);
	Структура.Вставить("ВиртуальныйХост", ВиртуальныйХост);
	Структура.Вставить("ТочкаОбмена", ТочкаОбмена);
	Структура.Вставить("ИмяОчереди", ИмяОчереди);
	
	КлиентКомпоненты = rabbitClientServer.ПолучитьКомпонентуСервер();
	ОтветноеСообщение = rabbitClientServer.ПрочитатьСообщениеКлиентСервер(КлиентКомпоненты,Структура);
	
	ОбработатьСообщениеНаСервере();   
	
КонецПроцедуры   

&НаСервере
Процедура ОбработатьСообщениеНаСервере()

	РегистрыСведений.ЖурналСобытий.ЗаписатьСобытиеВЖурнал(ОтветноеСообщение);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеОбщее()
	
	ТекстСообщения = ТекстСообщения();
	
	Структура = Новый Структура;
	Структура.Вставить("Адрес", Адрес);
	Структура.Вставить("Порт", Порт);
	Структура.Вставить("Логин", Логин);
	Структура.Вставить("Пароль", Пароль);
	Структура.Вставить("ВиртуальныйХост", ВиртуальныйХост);
	Структура.Вставить("ТочкаОбмена", ТочкаОбмена);
	Структура.Вставить("ИмяОчереди", ИмяОчереди); 
	Структура.Вставить("ТекстСообщения", ТекстСообщения);
	Структура.Вставить("КлючМаршрутизации", КлючМаршрутизации);
	
	КлиентКомпоненты = rabbitClientServer.ПолучитьКомпонентуСервер();
	rabbitClientServer.ОтправитьСообщениеКлиентСервер(КлиентКомпоненты,Структура);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ТекстСообщения()
	
	Возврат ExchangeServer.СформироватьНаСервереТекст();
	
КонецФункции // ()


#КонецОбласти
